       IDENTIFICATION  DIVISION. 
       PROGRAM-ID. P0661.
       ENVIRONMENT DIVISION. 
       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01  AA          PIC  9(4)  VALUE 11.
       01  BB          PIC  9(4)  VALUE 22.
       01  CC          PIC  9(4)  VALUE 33.
       01  PP          PIC  9(7)  VALUE 0.
       PROCEDURE DIVISION .
      *000-START.
           DISPLAY "                  "
           STOP RUN.